costinm/dmesh/fw/main/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# The classic ESP32's Bluetooth controller reserves internal DRAM before
# app_startup creates `main`.  A 64 KiB main stack consequently makes task
# creation fail before Rust runs.  Keep this aligned with the C6 budget; the
# S3 profile explicitly retains its 64 KiB override where that memory exists.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# Main's signed-object sink permits only the bounded Stage2 boot region for a
# target=2 request. ESP-IDF otherwise aborts writes below the partition table.
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
# Stage2, Main, and Recovery share the bootloader custom RTC block for the
# one-shot partition handoff.  Reserve the complete 16-byte IDF header plus
# 32-byte custom region so the application RTC heap cannot overwrite it.
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0x10
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=0x20
# Stack canaries turn an undersized task into a reboot with a serial panic
# record instead of silent adjacent-memory corruption. High-water telemetry
# then supplies the evidence for reducing task stacks safely.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_WIFI_NAN_ENABLE=y
# Main's BLE bearer is a short-lived NimBLE peripheral/CoC service.  CoC
# transports normal QUIC-lite packets; GATT remains available only for
# discovery and pairing policy, never application payload dispatch.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_GAP_SERVICE=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=1
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
# The native `dmesh_nimble` component owns the custom GATT surface.
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
# STA profiles may select a WPA3-Personal BSS after scanning.  Keep SAE and
# H2E in the Main image so that selection is backed by the ESP-IDF supplicant,
# rather than recognizing WPA3 only to fail authentication at runtime.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
